# Working with SQL Databases in Python

This notebook serves as reference code to demonstrate how to connect with a PostgreSQL database, run SQL queries directly in code cells, and store the database's response in a `pandas` DataFrame.

The code below relies on environment variables that locally store the username and password to the database so they aren't compromised publically in a notebook. To create these variables on a local machine, follow the following steps. Make sure the variable names don't conflict with existing ones.

**MacOS / Linux**
- Open the Terminal application
- Show all environment variables with `printenv` command
- Open the `.bash_profile` file and  include a line in the pattern `export [variable_name]=[variable_value]` for the "PGSQL_USER" and "PGSQL_PASSWORD" variables (example: `export PGSQL_USER='postgres'`)
- Save, close, and run `source .bash_profile` (or open a new Terminal window) before activating the environment and launching Jupyter notebook

**Windows**
- Open Start menu and type "env", select the "Edit the system environment variables" option
- In the pop-up, select the "Environment Variables" option
- Under the "System Variables" section, select "New", add the name and value for each variable (example: name is PGSQL_USER, value is postgres; quotes are not needed), hit "OK"
- Restart the command prompt before activating the environment and launching Jupyter notebook

In [1]:
%load_ext sql

In [26]:
import os
from sqlalchemy import create_engine, inspect
import pandas as pd

import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

ModuleNotFoundError: No module named 'matplotlib'

In [8]:
# Specify database credentials - update the values below to tie to your use case
host = "localhost"
database = "pagila"
user = os.getenv("PGSQL_USER")
password = os.getenv("PGSQL_PASSWORD")

In [9]:
connection_string = f"postgresql://{user}:{password}@{host}/{database}"

## Connect to DB via SQL Extension

In [10]:
%sql $connection_string

'Connected: postgres@pagila'

## Connect to DB via SQLAlchemy

In [11]:
engine = create_engine(connection_string)

In [12]:
insp = inspect(engine)
insp.get_table_names()

['payment',
 'film',
 'actor',
 'address',
 'category',
 'city',
 'country',
 'customer',
 'film_actor',
 'film_category',
 'inventory',
 'language',
 'rental',
 'staff',
 'store',
 'payment_p2020_01',
 'payment_p2020_02',
 'payment_p2020_03',
 'payment_p2020_04',
 'payment_p2020_05',
 'payment_p2020_06']

## Write SQL Directly in Code Cell

In [13]:
%%sql

SELECT * FROM actor
LIMIT 10;

 * postgresql://postgres:***@localhost/pagila
10 rows affected.

[(1, 'PENELOPE', 'GUINESS', datetime.datetime(2020, 2, 15, 4, 34, 33, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400)))),
 (2, 'NICK', 'WAHLBERG', datetime.datetime(2020, 2, 15, 4, 34, 33, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400)))),
 (3, 'ED', 'CHASE', datetime.datetime(2020, 2, 15, 4, 34, 33, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400)))),
 (4, 'JENNIFER', 'DAVIS', datetime.datetime(2020, 2, 15, 4, 34, 33, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400)))),
 (5, 'JOHNNY', 'LOLLOBRIGIDA', datetime.datetime(2020, 2, 15, 4, 34, 33, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400)))),
 (6, 'BETTE', 'NICHOLSON', datetime.datetime(2020, 2, 15, 4, 34, 33, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400)))),
 (7, 'GRACE', 'MOSTEL', datetime.datetime(2020, 2, 15, 4, 34, 33, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400)))),
 (8, 'MATTHEW', 'JOHANSSON', datetime.datetime(2020, 2, 15, 4, 34, 33, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400)))),
 (9, 'JOE', 'SWANK', datetime.datetime(2020, 2, 15, 4, 34, 33, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400)))),
 (10, 'CHRISTIAN', 'GABLE', datetime.datetime(2020, 2, 15, 4, 34, 33, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))))]

In [18]:
%%sql
SELECT * FROM film limit 2

 * postgresql://postgres:***@localhost/pagila
2 rows affected.

[(1, 'ACADEMY DINOSAUR', 'A Epic Drama of a Feminist And a Mad Scientist who must Battle a Teacher in The Canadian Rockies', 2006, 1, None, 6, Decimal('0.99'), 86, Decimal('20.99'), 'PG', datetime.datetime(2020, 9, 10, 12, 46, 3, 905795, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=72000))), ['Deleted Scenes', 'Behind the Scenes'], "'academi':1 'battl':15 'canadian':20 'dinosaur':2 'drama':5 'epic':4 'feminist':8 'mad':11 'must':14 'rocki':21 'scientist':12 'teacher':17"),
 (2, 'ACE GOLDFINGER', 'A Astounding Epistle of a Database Administrator And a Explorer who must Find a Car in Ancient China', 2006, 1, None, 3, Decimal('4.99'), 48, Decimal('12.99'), 'G', datetime.datetime(2020, 9, 10, 12, 46, 3, 905795, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=72000))), ['Trailers', 'Deleted Scenes'], "'ace':1 'administr':9 'ancient':19 'astound':4 'car':17 'china':20 'databas':8 'epistl':5 'explor':12 'find':15 'goldfing':2 'must':14")]

In [16]:
%%sql
SELECT * FROM category LIMIT 2

 * postgresql://postgres:***@localhost/pagila
2 rows affected.

[(1, 'Action', datetime.datetime(2020, 2, 15, 4, 46, 27, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400)))),
 (2, 'Animation', datetime.datetime(2020, 2, 15, 4, 46, 27, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))))]

In [17]:
%%sql
SELECT * FROM film_category LIMIT 2

 * postgresql://postgres:***@localhost/pagila
2 rows affected.

[(1, 6, datetime.datetime(2020, 2, 15, 5, 7, 9, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400)))),
 (2, 11, datetime.datetime(2020, 2, 15, 5, 7, 9, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))))]

In [20]:
%%sql
SELECT * FROM language LIMIT 2

 * postgresql://postgres:***@localhost/pagila
2 rows affected.

[(1, 'English             ', datetime.datetime(2020, 2, 15, 5, 2, 19, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400)))),
 (2, 'Italian             ', datetime.datetime(2020, 2, 15, 5, 2, 19, tzinfo=datetime.timezone(datetime.timedelta(days=-1, seconds=68400))))]

## Store DB Response to DataFrame

In [22]:
query = """SELECT
  f.title,
  f.description,
  f.release_year,
  f.length,
  f.rating,
  c.name as category,
  l.name as language
FROM film as f
JOIN film_category as f_c
  USING (film_id)
LEFT JOIN category as c
  USING (category_id)
LEFT JOIN language as l
  USING (language_id)
LIMIT 10;
"""

In [23]:
films = pd.read_sql(query, con=engine)

films.head()

,title,description,release_year,length,rating,category,language
0,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,86,PG,Documentary,English
1,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,48,G,Horror,English
2,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,50,NC-17,Documentary,English
3,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,117,G,Horror,English
4,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,130,G,Family,English